# <center> Data Merging & Derving </center>

## 01. Import libraries & Data

In [28]:
import pandas as pd
import numpy as np
import os

In [29]:
path = r'C:\Users\thang\Desktop\Data Analytics\Data Analytics Immersion\Python\Instacart Basket Analysis'

In [30]:
orders_cleaned = pd.read_pickle(os.path.join(path, '2. Data', 'Modified', 'orders_cleaned.pkl'))
ords_prods_prior_cleaned = pd.read_pickle(os.path.join(path, '2. Data', 'Modified', 'order_products_prior_cleaned.pkl'))
products_cleaned = pd.read_pickle(os.path.join(path, '2. Data', 'Modified', 'products_cleaned.pkl'))
customers_cleaned = pd.read_pickle(os.path.join(path, '2. Data', 'Modified', 'customers_cleaned.pkl'))
departments = pd.read_pickle(os.path.join(path, '2. Data', 'Modified', 'departments_wrangled.pkl'))

## 02. orders + orders_products_prior = orders_products_combined

In [31]:
# find the key column & its data types
orders_cleaned.dtypes

order_id                    int32
customer_id                 int32
order_number                 int8
order_day_of_week            int8
order_hour_of_day            int8
days_since_prior_order    float64
dtype: object

In [32]:
ords_prods_prior_cleaned.dtypes

order_id             int32
product_id           int32
add_to_cart_order    int16
reordered             int8
dtype: object

In [33]:
# merge on order_id
ords_prods_combined = orders_cleaned.merge(ords_prods_prior_cleaned, on = 'order_id', how = 'inner', indicator = True )

In [34]:
# check the result
ords_prods_combined['_merge'].value_counts(dropna = False)

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

In [35]:
ords_prods_combined.shape

(32434489, 10)

In [36]:
# check theresult & drop unwanted columns
ords_prods_combined.head()

,order_id,customer_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [37]:
ords_prods_combined.drop(columns = ['add_to_cart_order', 'reordered', '_merge'], inplace = True)

## 03. orders_products_combined + products = orders_products_merged

In [38]:
# find the key column & data types
products_cleaned.dtypes

product_id        int32
product_name     object
aisle_id          int16
department_id      int8
prices            int32
dtype: object

In [39]:
# combine on product_id 
ord_prods_merged = ords_prods_combined.merge(products_cleaned, on = 'product_id', how = 'inner', indicator = True )

In [40]:
ord_prods_merged['_merge'].value_counts(dropna = False)

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [41]:
ord_prods_merged.shape

(32404859, 12)

In [42]:
# check the result & drop unwanted columns
ord_prods_merged.head()

,order_id,customer_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,Soda,77,7,9,both
1,2398795,1,2,3,7,15.0,196,Soda,77,7,9,both
2,473747,1,3,3,12,21.0,196,Soda,77,7,9,both
3,2254736,1,4,4,7,29.0,196,Soda,77,7,9,both
4,431534,1,5,4,15,28.0,196,Soda,77,7,9,both

In [43]:
ord_prods_merged.drop(columns = ['_merge'], inplace = True)

## 04. orders_products_merged + customers = order_products_all

In [44]:
# find key column & its data types
customers_cleaned.dtypes

customer_id        int32
first_name        object
last_name         object
gender          category
state           category
age                 int8
n_dependants        int8
fam_status      category
income             int32
dtype: object

In [45]:
# merge on customer_id
ord_prods_all = ord_prods_merged.merge(customers_cleaned, on = 'customer_id', how = 'inner', indicator = True)

In [46]:
ord_prods_all['_merge'].value_counts(dropna = False)

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [47]:
ord_prods_all.shape

(32404859, 20)

In [48]:
# check the result & drop unwanted columns
ord_prods_all.head()

,order_id,customer_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,product_name,aisle_id,department_id,prices,first_name,last_name,gender,state,age,n_dependants,fam_status,income,_merge
0,2539329,1,1,2,8,NaN,196,Soda,77,7,9,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,Soda,77,7,9,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
2,473747,1,3,3,12,21.0,196,Soda,77,7,9,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,Soda,77,7,9,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
4,431534,1,5,4,15,28.0,196,Soda,77,7,9,Linda,Nguyen,Female,Alabama,31,3,married,40423,both

In [49]:
ord_prods_all.drop(columns = ['_merge'], inplace = True)

## 06. Export

In [50]:
ord_prods_all.to_pickle(os.path.join(path, '2. Data', 'Modified', 'Instacart_Data.pkl'))